# в якому визначте функцію calculate_average(numbers). Функція повинна приймати список чисел та повертати їхнє
# середнє значення.Якщо список порожній, функція повинна повертати None.
# 2. Створіть файл test_average_calculator.py, який міститиме юніт - тести для функції calculate_average.
# 3. У файлі test_average_calculator.py визначте клас TestAverageCalculator, який міститиме тестові методи.
# Напишіть тести для наступних випадків:
# Перевірте, чи функція правильно обчислює середнє значення для списку чисел. Перевірте, чи функція повертає
# None, якщо список порожній. Перевірте, чи функція правильно обробляє списки, що містять лише одне число.
# Перевірте, чи функція правильно обробляє списки з негативними числами. Запустіть тести з використанням фреймворку
# для тестування, такого як unittest.Переконайтеся, що всі випробування проходять успішно.

def calculate_average(*numbers):
    if numbers == ():
        return None
    else:
        return sum(numbers) / len(numbers)