# Завдання 1
# Реалізуйте клас «Людина». Збережіть у класі: ПІБ, дату народження, контактний телефон, місто, країну, домашню адресу.
# Реалізуйте методи класу для введення-виведення даних та інших операцій.
# Додати метод is_major, який повертає True, якщо людина повнолітня (більше або одно 18 років) інакше False.
#
# Завдання 2
# Створіть клас «Місто». Збережіть у класі: назву міста, назву регіону, назву країни, кількість жителів у місті, поштовий індекс міста,
# телефонний код міста. Реалізуйте методи класу для введення-виведення даних та інших операцій.
# Написати метод is_valid_zipcode, який повертає True якщо __zipcode містить 5 цифр.
#
# Завдання 3
# Створіть клас «Країна». Збережіть у класі: назву країни, назву континенту, кількість жителів країни, телефонний код країни, назву столиці,
# назву міст країни. Реалізуйте методи класу для введення-виведення даних та інших операцій.
#
# Завдання 4
# Реалізуйте клас «Автомобіль». Збережіть у класі: назву моделі, рік випуску, виробника, об'єм двигуна, колір машини, ціну.
# Реалізуйте методи класу для введення-виведення даних та інших операцій.
#
# Завдання 5
# Реалізуйте клас «Книга». Збережіть у класі: назву книги, рік видання, видавця, жанр, автора, ціну.
# Реалізуйте методи класу для введення-виведення даних та інших операцій.